Show / Hide Table of Contents
Class IdeaConnectionController
Inheritance
System.Object
IdeaConnectionController
Implements
System.IDisposable
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class IdeaConnectionController : IDisposable
Fields
Improve this Doc   View Source
CurrentItemChangedEvent
Declaration
protected EventWaitHandle CurrentItemChangedEvent
Field Value
 Type |  Description
 System.Threading.EventWaitHandle
Properties
Improve this Doc   View Source
ConnectionAppAutomation
Declaration
public IAutomation ConnectionAppAutomation { get; }
Property Value
 Type |  Description
 IAutomation
Improve this Doc   View Source
ConnectionAppClient
Declaration
protected IdeaStatiCaClient<IAutomation> ConnectionAppClient { get; set; }
Property Value
 Type |  Description
 IdeaStatiCaClient<IAutomation>
Improve this Doc   View Source
UserMode
Declaration
protected virtual uint UserMode { get; }
Property Value
 Type |  Description
 System.UInt32
Methods
Improve this Doc   View Source
Create(String)
Declaration
public static IdeaConnectionController Create(string ideaInstallDir)
Parameters
 Type |  Name |  Description
 System.String |  ideaInstallDir
Returns
 Type |  Description
 IdeaConnectionController
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Implements
 System.IDisposable
 Improve this Doc
 View Source